#T-buttons Version 2.0 ==:> AMAZING BUTTONS ( The Coding Master Edition )
#By John kener
#Copyright 2021-* John-Kener
#Hey bro this code is not encrypted ,so you can steal my code 🙈😂


import os,time,sys
from time import sleep


def scw_about():
        import colorama,os
        from colorama import Fore, Back, Style
        colorama.init(autoreset=True)
        p = (f"{Back.BLACK}{Fore.WHITE}[+]{Back.RESET}{Fore.GREEN}")
        os.system("clear")


        #MEWA 4 WITHARAK CUSTOMIZE KARANNA
        t1 = "\t\t\t  "
        name = "John Kener"
        tool_name = "AMAZING BUTTONS"
        launch_tool = "python Amazing-buttons.py"

        print ("\n")
        print (f"{t1}{Back.BLUE}{Fore.WHITE} {tool_name} {Back.RESET} \n")

        print (Fore.GREEN+f'''
+----------------------------------------------------------------+
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡀⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠄⠄⠄⠁⠄⠁⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⣀⣀⣤⣤⣴⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣶⣦⣤⣤⣄⣀⡀⠄⠄⠄⠄⠄
⠄⠄⠄⠄⣴⣿⣿⡿⣿⢿⣟⣿⣻⣟⡿⣟⣿⣟⡿⣟⣿⣻⣟⣿⣻⢿⣻⡿⣿⢿⣷⣆⠄⠄⠄    {Back.GREEN}{Fore.BLACK}  SL CYBER WARRIORS™  {Back.RESET}{Fore.GREEN}
⠄⠄⠄⢘⣿⢯⣷⡿⡿⡿⢿⢿⣷⣯⡿⣽⣞⣷⣻⢯⣷⣻⣾⡿⡿⢿⢿⢿⢯⣟⣞⡮⡀⠄⠄
⠄⠄⠄⢸⢞⠟⠃⣉⢉⠉⠉⠓⠫⢿⣿⣷⢷⣻⣞⣿⣾⡟⠽⠚⠊⠉⠉⠉⠙⠻⣞⢵⠂⠄⠄    {p} Coded By {name}
⠄⠄⠄⢜⢯⣺⢿⣻⣿⣿⣷⣔⡄⠄⠈⠛⣿⣿⡾⠋⠁⠄⠄⣄⣶⣾⣿⡿⣿⡳⡌⡗⡅⠄⠄
⠄⠄⠄⢽⢱⢳⢹⡪⡞⠮⠯⢯⡻⡬⡐⢨⢿⣿⣿⢀⠐⡥⣻⡻⠯⡳⢳⢹⢜⢜⢜⢎⠆⠄⠄    {p} ©2021- {name} &
⠄⠄⠠⣻⢌⠘⠌⡂⠈⠁⠉⠁⠘⠑⢧⣕⣿⣿⣿⢤⡪⠚⠂⠈⠁⠁⠁⠂⡑⠡⡈⢮⠅⠄⠄        SLCW TEAM
⠄⠄⠠⣳⣿⣿⣽⣭⣶⣶⣶⣶⣶⣺⣟⣾⣻⣿⣯⢯⢿⣳⣶⣶⣶⣖⣶⣮⣭⣷⣽⣗⠍⠄⠄
⠄⠄⢀⢻⡿⡿⣟⣿⣻⣽⣟⣿⢯⣟⣞⡷⣿⣿⣯⢿⢽⢯⣿⣻⣟⣿⣻⣟⣿⣻⢿⣿⢀⠄⠄     {Fore.RED}❏ We Are Not In DANGER{Fore.GREEN}
⠄⠄⠄⡑⡏⠯⡯⡳⡯⣗⢯⢟⡽⣗⣯⣟⣿⣿⣾⣫⢿⣽⠾⡽⣺⢳⡫⡞⡗⡝⢕⠕⠄⠄⠄       {Fore.RED}We Are The DANGER{Fore.GREEN}
⠄⠄⠄⢂⡎⠅⡃⢇⠇⠇⣃⣧⡺⡻⡳⡫⣿⡿⣟⠞⠽⠯⢧⣅⣃⠣⠱⡑⡑⠨⢐⢌⠂⠄⠄
⠄⠄⠄⠐⠼⣦⢀⠄⣶⣿⢿⣿⣧⣄⡌⠂⠢⠩⠂⠑⣁⣅⣾⢿⣟⣷⠦⠄⠄⡤⡇⡪⠄⠄⠄
⠄⠄⠄⠄⠨⢻⣧⡅⡈⠛⠿⠿⠿⠛⠁⠄⢀⡀⠄⠄⠘⠻⠿⠿⠯⠓⠁⢠⣱⡿⢑⠄⠄⠄⠄
⠄⠄⠄⠄⠈⢌⢿⣷⡐⠤⣀⣀⣂⣀⢀⢀⡓⠝⡂⡀⢀⢀⢀⣀⣀⠤⢊⣼⡟⡡⡁⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠈⢢⠚⣿⣄⠈⠉⠛⠛⠟⠿⠿⠟⠿⠻⠻⠛⠛⠉⠄⣠⠾⢑⠰⠈⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠑⢌⠿⣦⡡⣱⣸⣸⣆⠄⠄⠄⣰⣕⢔⢔⠡⣼⠞⡡⠁⠁⠄⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠑⢝⢷⣕⡷⣿⡿⠄⠄⠠⣿⣯⣯⡳⡽⡋⠌⠄⠄⠄⠄⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⢮⣿⣽⣯⠄⠄⢨⣿⣿⡷⡫⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠘⠙⠝⠂⠄⢘⠋⠃⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
+----------------------------------------------------------------+
{Fore.BLUE}
# Telegram : https://t.me/By_sstp
# Youtube  : https://bit.ly/37AxYEF

''')

        input("$ Enter to go home back : ")
        os.system("clear")
        os.system(launch_tool)






os.system("clear")
print ("""
\t\033[36m            ██╗ ██████╗ ██╗  ██╗███╗   ██╗
\t\033[36m            ██║██╔═══██╗██║  ██║████╗  ██║
\t\033[36m            ██║██║   ██║███████║██╔██╗ ██║
\t\033[36m       ██   ██║██║   ██║██╔══██║██║╚██╗██║
\t\033[36m       ╚█████╔╝╚██████╔╝██║  ██║██║ ╚████║
\t\033[36m        ╚════╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝

\t\033[36m    ██╗  ██╗███████╗███╗   ██╗███████╗██████╗
\t\033[36m    ██║ ██╔╝██╔════╝████╗  ██║██╔════╝██╔══██╗
\t\033[36m    █████╔╝ █████╗  ██╔██╗ ██║█████╗  ██████╔╝
\t\033[36m    ██╔═██╗ ██╔══╝  ██║╚██╗██║██╔══╝  ██╔══██╗
\t\033[36m    ██║  ██╗███████╗██║ ╚████║███████╗██║  ██║
\t\033[36m    ╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝\033[0m""")
sleep (2)

def shortcut():
	if os.path.exists("/data/data/com.termux/files/usr/bin/buttons"):
		os.remove("/data/data/com.termux/files/usr/bin/buttons")
	
	with open("buttons","w") as sh:
	        sh.write("python /data/data/com.termux/files/home/Amazing-Buttons/tmp/main.py")
	 
	os.system("mv buttons /data/data/com.termux/files/usr/bin")
	os.system("cd /data/data/com.termux/files/usr/bin && chmod +x buttons ")


ab = ["\n\033[44m\033[39mJohn Kener John Kener John Kener John Kener John Kener John Kener \033[49m\n\n",
				"\n\033[93m\t     \033[40m🔰 Coded By John Kener \033[49m\n",
				"\n\033[93m\t     \033[40m👑 Owner of the Sl Cyber Warriors™ \033[49m\n",
				"\n\033[93m\t     \033[40m📌 SCW COMMUNITY BY :\033[49m\n",
				"\033[93m\t\t     \033[40m👉John Kener ft. Dave smith \033[49m\n",
				"\n\033[93m\t     \033[40mJoin with us:\033[49m\n",
				"\033[93m\t\t     \033[40mTelegram: http://t.me/By_sstp\033[49m\n\n\n",
				"\033[44m\033[39mJohn Kener John Kener John Kener John Kener John Kener John Kener \033[49m\n\n"]


os.system("clear")
shortcut()

banner = ["\n\033[92m      █████╗ ███╗   ███╗ █████╗ ███████╗██╗███╗   ██╗ ██████╗ ",
"\n     ██╔══██╗████╗ ████║██╔══██╗╚══███╔╝██║████╗  ██║██╔════╝ ",
"\n     ███████║██╔████╔██║███████║  ███╔╝ ██║██╔██╗ ██║██║  ███╗",
"\n     ██╔══██║██║╚██╔╝██║██╔══██║ ███╔╝  ██║██║╚██╗██║██║   ██║",
"\n     ██║  ██║██║ ╚═╝ ██║██║  ██║███████╗██║██║ ╚████║╚██████╔╝",
"\n     ╚═╝  ╚═╝╚═╝     ╚═╝╚═╝  ╚═╝╚══════╝╚═╝╚═╝  ╚═══╝ ╚═════╝ "
"\n\n  ██████╗ ██╗   ██╗████████╗████████╗ ██████╗ ███╗   ██╗███████╗",
"\n  ██╔══██╗██║   ██║╚══██╔══╝╚══██╔══╝██╔═══██╗████╗  ██║██╔════╝",
"\n  ██████╔╝██║   ██║   ██║      ██║   ██║   ██║██╔██╗ ██║███████╗",
"\n  ██╔══██╗██║   ██║   ██║      ██║   ██║   ██║██║╚██╗██║╚════██║",
"\n  ██████╔╝╚██████╔╝   ██║      ██║   ╚██████╔╝██║ ╚████║███████║",
"\n  ╚═════╝  ╚═════╝    ╚═╝      ╚═╝    ╚═════╝ ╚═╝  ╚═══╝╚══════╝\n"
"\n\033[31m\033[01m\t\t   \033[04m+ CODING MASTER EDITION V 2.0 \033[0m",
"\n\033[31m\033[01m\t\t\t  \033[04m+ By John Kener \n\033[0m"]


for banner in banner :
    for ban in banner:
        print(ban, end='')
        sys.stdout.flush()
        time.sleep(0.002)
        
choices =[
    "\n\n\t\t\t  \033[40m[1] Add Buttons \033[0m",
    "\n\t\t\t  \033[40m[2] Update Tool \033[0m",
    "\n\t\t\t  \033[40m[3] Comment     \033[0m",
    "\n\t\t\t  \033[40m[4] About       \033[0m",
    "\n\t\t\t  \033[40m[5] Exit        \033[0m\n",
    "\n\n #~ Choice : "]
    
for choices in choices :
    for choice in choices :
        print(choice,end='')
        sys.stdout.flush()
        time.sleep(0.003)

cho = int(input())


if cho ==1:
	sleep(0.2)
	os.system("python tmp/main.py")
	
elif cho ==2:
	sleep(0.2)
	os.system("clear")
	os.system("git pull")
	os.system("python Amazing-buttons.py")
	
elif cho ==3:
	print()
	print()
	print ("\033[32m [+] Tell me your ideas or report bugs  ")
	os.system("xdg-open https://wa.me/+94788655161?text=\(©𝓙𝓸𝓱𝓷✓\)_Comment_on_Amazing-Buttons_Tool:-")
	os.system("python Amazing-buttons.py")
	
elif cho ==4:
	os.system("clear")
	scw_about()
	       	
	input("\n\n\033[32m [+] Enter To Go Home \033[0m")
	os.system("python Amazing-buttons.py")
	
elif cho ==5:
	print("\n\033[32m[♥] Thank You ...\033[0m\n")
	exit()
